podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_ANALOG_MKW41Z4.svd.xml
<!--
Devices using this peripheral: 
      MKW41Z4
-->
      <peripheral>
         <?sourceFile "XCVR_ANALOG_MKW41Z4" ?>
         <name>XCVR_ANALOG</name>
         <description>XCVR_ANALOG</description>
         <groupName>XCVR_ANALOG</groupName>
         <headerStructName>XCVR_ANALOG</headerStructName>
         <baseAddress>0x4005C500</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>BB_LDO_1</name>
               <description>RF Analog Baseband LDO Control 1</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>BB_LDO_ADCDAC_BYP</name>
                     <description>rmap_bb_ldo_adcdac_byp</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Bypass disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Bypass enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_ADCDAC_DIAGSEL</name>
                     <description>rmap_bb_ldo_adcdac_diagsel</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Diag disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Diag enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_ADCDAC_SPARE</name>
                     <description>rmap_bb_ldo_adcdac_spare[1:0]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_ADCDAC_TRIM</name>
                     <description>rmap_bb_ldo_adcdac_trim[2:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>1.20 V ( Default )</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>1.25 V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>1.28 V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>1.33 V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>1.40 V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>1.44 V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>1.50 V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>1.66 V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BB_LDO_ADCDAC_BYP" > <name>BB_LDO_BBA_BYP</name> <description>rmap_bb_ldo_bba_byp</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="BB_LDO_ADCDAC_DIAGSEL" > <name>BB_LDO_BBA_DIAGSEL</name> <description>rmap_bb_ldo_bba_diagsel</description> <bitOffset>9</bitOffset> </field>
                  <field>
                     <name>BB_LDO_BBA_SPARE</name>
                     <description>rmap_bb_ldo_bba_spare[1:0]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_BBA_TRIM</name>
                     <description>rmap_bb_ldo_bba_trim[2:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1.20 V ( Default )</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.25 V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.28 V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.33 V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>1.40 V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>1.44 V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>1.50 V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>1.66 V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BB_LDO_ADCDAC_BYP" > <name>BB_LDO_FDBK_BYP</name> <description>rmap_bb_ldo_fdbk_byp</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="BB_LDO_ADCDAC_DIAGSEL" > <name>BB_LDO_FDBK_DIAGSEL</name> <description>rmap_bb_ldo_fdbk_diagsel</description> <bitOffset>17</bitOffset> </field>
                  <field>
                     <name>BB_LDO_FDBK_SPARE</name>
                     <description>rmap_bb_ldo_fdbk_spare[1:0]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_FDBK_TRIM</name>
                     <description>rmap_bb_ldo_fdbk_trim[2:0]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1.2/1.176 V ( Default )</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.138/1.115 V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.085/1.066 V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.04/1.025 V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>1.28/1.25 V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>1.4/1.35 V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>1.55/1.4 V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>1.78/1.4 V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BB_LDO_ADCDAC_BYP" > <name>BB_LDO_HF_BYP</name> <description>rmap_bb_ldo_hf_byp</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="BB_LDO_ADCDAC_DIAGSEL" > <name>BB_LDO_HF_DIAGSEL</name> <description>rmap_bb_ldo_hf_diagsel</description> <bitOffset>25</bitOffset> </field>
                  <field>
                     <name>BB_LDO_HF_SPARE</name>
                     <description>rmap_bb_ldo_hf_spare[1:0]</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field derivedFrom="BB_LDO_BBA_TRIM" > <name>BB_LDO_HF_TRIM</name> <description>rmap_bb_ldo_hf_trim[2:0]</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>BB_LDO_2</name>
               <description>RF Analog Baseband LDO Control 2</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>BB_LDO_PD_BYP</name>
                     <description>rmap_bb_ldo_pd_byp</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Bypass disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Bypass enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_PD_DIAGSEL</name>
                     <description>rmap_bb_ldo_pd_diagsel</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Diag disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Diag enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_PD_SPARE</name>
                     <description>rmap_bb_ldo_pd_spare[1:0]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_PD_TRIM</name>
                     <description>rmap_bb_ldo_pd_trim[2:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1.20 V ( Default )</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.25 V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.28 V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.33 V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>1.40 V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>1.44 V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>1.50 V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>1.66 V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_VCO_SPARE</name>
                     <description>rmap_bb_ldo_vco_spare[1:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field derivedFrom="BB_LDO_PD_BYP" > <name>BB_LDO_VCOLO_BYP</name> <description>rmap_bb_ldo_vcolo_byp</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="BB_LDO_PD_DIAGSEL" > <name>BB_LDO_VCOLO_DIAGSEL</name> <description>rmap_bb_ldo_vcolo_diagsel</description> <bitOffset>11</bitOffset> </field>
                  <field>
                     <name>BB_LDO_VCOLO_TRIM</name>
                     <description>rmap_bb_ldo_vcolo_trim[2:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1.138/1.117 V ( Default )</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.076/1.058 V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.027/1.012 V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>0.98/0.97 V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>1.22/1.19 V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>1.33/1.3 V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>1.5/1.4 V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>1.82/1.4 V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BB_LDO_PD_DIAGSEL" > <name>BB_LDO_VTREF_DIAGSEL</name> <description>rmap_bb_ldo_vtref_diagsel</description> <bitOffset>16</bitOffset> </field>
                  <field>
                     <name>BB_LDO_VTREF_TC</name>
                     <description>rmap_bb_ldo_vtref_tc[1:0]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1.117/1.176 V</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.134/1.188 V</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.10/1.162 V</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.09/1.152 V</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_ADC</name>
               <description>RF Analog ADC Control</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0x140</resetValue>
               <fields>
                  <field>
                     <name>RX_ADC_BUMP</name>
                     <description>rmap_rx_adc_bump[7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RX_ADC_FS_SEL</name>
                     <description>rmap_rx_adc_fs_sel[1:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>52MHz (2x26MHz)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>64MHz (2x32MHz)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>+13% of 64MHz</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>- 11% of 64MHz</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_ADC_I_DIAGSEL</name>
                     <description>rmap_rx_adc_i_diagsel</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_ADC_Q_DIAGSEL</name>
                     <description>rmap_rx_adc_q_diagsel</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_ADC_SPARE</name>
                     <description>rmap_rx_adc_spare[3:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
