podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_ANALOG_MKW41Z4.svd.xml
            <register>
               <name>RX_BBA</name>
               <description>RF Analog BBA Control</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0x3000003</resetValue>
               <fields>
                  <field>
                     <name>RX_BBA_BW_SEL</name>
                     <description>rmap_rx_bba_bw_sel[2:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>1000K</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>900K</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>800K</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>700K Default</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>600K</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>500K</description>
                           <value>0b101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_BBA_CUR_BUMP</name>
                     <description>rmap_rx_bba_cur_bump</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BBA_DIAGSEL1</name>
                     <description>rmap_rx_bba_diagsel1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Diag disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Diag enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RX_BBA_DIAGSEL1" > <name>RX_BBA_DIAGSEL2</name> <description>rmap_rx_bba_diagsel2</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="RX_BBA_DIAGSEL1" > <name>RX_BBA_DIAGSEL3</name> <description>rmap_rx_bba_diagsel3</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="RX_BBA_DIAGSEL1" > <name>RX_BBA_DIAGSEL4</name> <description>rmap_rx_bba_diagsel4</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>RX_BBA_SPARE</name>
                     <description>rmap_rx_bba_spare[5:0]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>600mV (Default)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>675mV</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>450mV</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>525mV</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RX_BBA_BW_SEL" > <name>RX_BBA2_BW_SEL</name> <description>rmap_bba2_bw_sel[2:0]</description> <bitOffset>24</bitOffset> </field>
                  <field>
                     <name>RX_BBA2_SPARE</name>
                     <description>rmap_rx_bba2_spare[2:0]</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_LNA</name>
               <description>RF Analog LNA Control</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>RX_LNA_BUMP</name>
                     <description>rmap_rx_lna_bump[3:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Default</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>-25%</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>+50%</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>+25%</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>CM 480mV</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8</name>
                           <description>CM 600mV</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12</name>
                           <description>CM 660mV</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_LNA_HG_DIAGSEL</name>
                     <description>rmap_rx_lna_hg_diagsel</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_LNA_HIZ_ENABLE</name>
                     <description>rmap_rx_lna_hiZ_enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_LNA_LG_DIAGSEL</name>
                     <description>rmap_rx_lna_lg_diagsel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_LNA_SPARE</name>
                     <description>rmap_rx_lna_spare[1:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RX_MIXER_BUMP</name>
                     <description>rmap_rx_mixer_bump[3:0]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>825mV (Default)</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>750mV</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>900mV</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>975mV</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_MIXER_SPARE</name>
                     <description>rmap_rx_mixer_spare</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_TZA</name>
               <description>RF Analog TZA Control</description>
               <addressOffset>0x14</addressOffset>
               <resetValue>0x3</resetValue>
               <fields>
                  <field>
                     <name>RX_TZA_BW_SEL</name>
                     <description>rmap_rx_tza_bw_sel[2:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>1000K</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>900K</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>800K</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>700K Default</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>600K</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>500K</description>
                           <value>0b101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_TZA_CUR_BUMP</name>
                     <description>rmap_rx_tza_cur_bump</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_TZA_GAIN_BUMP</name>
                     <description>rmap_rx_tza_gain_bump</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_TZA_SPARE</name>
                     <description>rmap_rx_tza_spare[5:0]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>600mV (Default)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>675mV</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>450mV</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>525mV</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_TZA1_DIAGSEL</name>
                     <description>rmap_rx_tza1_diagsel</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Diag disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Diag enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RX_TZA1_DIAGSEL" > <name>RX_TZA2_DIAGSEL</name> <description>rmap_rx_tza2_diagsel</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="RX_TZA1_DIAGSEL" > <name>RX_TZA3_DIAGSEL</name> <description>rmap_rx_tza3_diagsel</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="RX_TZA1_DIAGSEL" > <name>RX_TZA4_DIAGSEL</name> <description>rmap_rx_tza4_diagsel</description> <bitOffset>27</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>RX_AUXPLL</name>
               <description>RF Analog Aux PLL Control</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0x9002</resetValue>
               <fields>
                  <field>
                     <name>BIAS_TRIM</name>
                     <description>rmap_rxtx_auxpll_bias_trim[2:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DIAGSEL1</name>
                     <description>rmap_rxtx_auxpll_diagsel1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIAGSEL2</name>
                     <description>rmap_rxtx_auxpll_diagsel2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LF_CNTL</name>
                     <description>rmap_rxtx_auxpll_lf_cntl[2:0]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SPARE</name>
                     <description>rmap_rxtx_auxpll_spare[3:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VCO_DAC_REF_ADJUST</name>
                     <description>rmap_rxtx_auxpll_vco_dac_ref_adjust[3:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VTUNE_TESTMODE</name>
                     <description>rmap_rxtx_auxpll_vtune_testmode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_BAL_BIAST</name>
                     <description>rmap_rxtx_bal_biast[1:0]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>0.6</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>0.4</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>0.9</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.2</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXTX_BAL_SPARE</name>
                     <description>rmap_rxtx_bal_spare[2:0]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_RCCAL_DIAGSEL</name>
                     <description>rmap_rxtx_rccal_diagsel</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
