podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_ANALOG_MKW41Z4.svd.xml
            <register>
               <name>SY_CTRL_1</name>
               <description>RF Analog Synthesizer Control 1</description>
               <addressOffset>0x1C</addressOffset>
               <resetValue>0x150</resetValue>
               <fields>
                  <field>
                     <name>SY_DIVN_SPARE</name>
                     <description>rmap_sy_divn_spare</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_FCAL_SPARE</name>
                     <description>rmap_sy_fcal_spare</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_LO_BUMP_RTLO_FDBK</name>
                     <description>rmap_sy_lo_bump_rtlo_fdbk[1:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1.045 V</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.084 V</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.097 V</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.10 V</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_BUMP_RTLO_RX</name>
                     <description>rmap_sy_lo_bump_rtlo_rx[1:0]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1.051/1.037 V</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.082/1.075 V</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.092/1.088 V</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.098/1.094 V</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_BUMP_RTLO_TX</name>
                     <description>rmap_sy_lo_bump_rtlo_tx[1:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1.071/1.065 V</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.092/1.090 V</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.099/1.098 V</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.10/1.1 V</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_DIAGSEL</name>
                     <description>rmap_sy_lo_diagsel</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Diag disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Diag enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_SPARE</name>
                     <description>rmap_sy_lo_spare[2:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SY_LPF_FILT_CTRL</name>
                     <description>rmap_sy_lpf_filt_ctrl[2:0]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SY_LPF_SPARE</name>
                     <description>rmap_sy_lpf_spare</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_PD_DIAGSEL</name>
                     <description>rmap_sy_pd_diagsel</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_PD_PCH_TUNE</name>
                     <description>rmap_sy_pd_pch_tune[1:0]</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SY_PD_PCH_SEL</name>
                     <description>rmap_sy_pd_pch_sel</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>inverter based precharge</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>resistor divider based precharge</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_PD_SPARE</name>
                     <description>rmap_sy_pd_spare[1:0]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Default ;</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PD output is pulled down</description>
                           <value>0b01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_PD_VTUNE_OVERRIDE_TEST_MODE</name>
                     <description>rmap_sy_pd_vtune_override_test_mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SY_CTRL_2</name>
               <description>RF Analog Synthesizer Control 2</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0x14</resetValue>
               <fields>
                  <field>
                     <name>SY_VCO_BIAS</name>
                     <description>rmap_sy_vco_bias[2:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>0.97V</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.033V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.06V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1.07V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>1.08V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>1.085V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>1.090V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>1.095V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_VCO_DIAGSEL</name>
                     <description>rmap_sy_vco_diagsel</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Diag enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Diag disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_VCO_KV</name>
                     <description>rmap_sy_vco_kv[2:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>50MHz/V</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>60MHz/V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>70MHz/V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>80MHz/V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>80MHz/V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>80MHz/V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>80MHz/V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>80MHz/V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_VCO_KVM</name>
                     <description>rmap_sy_vco_kvm[2:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>10MHz/V</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>20MHz/V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>30MHz/V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>40MHz/V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>40MHz/V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>40MHz/V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>40MHz/V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>40MHz/V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_VCO_PK_DET_ON</name>
                     <description>rmap_sy_vco_pk_det_on</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_VCO_SPARE</name>
                     <description>rmap_sy_vco_spare[2:0]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
