podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_ANALOG_MKW41Z4.svd.xml
            <register>
               <name>TX_DAC_PA</name>
               <description>RF Analog TX HPM DAC and PA Control</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0x20000</resetValue>
               <fields>
                  <field>
                     <name>TX_DAC_BUMP_CAP</name>
                     <description>rmap_tx_dac_bump_cap[1:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1pF(default)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.5pF</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1.5pF</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>2pF</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX_DAC_BUMP_IDAC</name>
                     <description>rmap_tx_dac_bump_idac[1:0]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>250nA(default)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>207nA</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>312nA</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>415nA</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX_DAC_BUMP_RLOAD</name>
                     <description>rmap_tx_dac_bump_rload[1:0]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>3.12 kohms(default)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>2.34 kohms</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>3.9 kohms</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>4.6 kohms</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX_DAC_DIAGSEL</name>
                     <description>rmap_tx_dac_diagsel</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable Diag</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable Diag</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX_DAC_INVERT_CLK</name>
                     <description>rmap_tx_dac_invert_clk</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="TX_DAC_DIAGSEL" > <name>TX_DAC_OPAMP_DIAGSEL</name> <description>rmap_tx_dac_opamp_diagsel</description> <bitOffset>11</bitOffset> </field>
                  <field>
                     <name>TX_DAC_SPARE</name>
                     <description>rmap_tx_dac_spare[2:0]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TX_PA_BUMP_VBIAS</name>
                     <description>rmap_tx_pa_bump_vbias[2:0]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>0.557</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>0.651</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>0.741</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>0.822</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>0.590</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>0.683</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>0.771</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>0.850</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX_PA_DIAGSEL</name>
                     <description>rmap_tx_pa_diagsel</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_PA_SPARE</name>
                     <description>rmap_tx_pa_spare[2:0]</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BALUN_TX</name>
               <description>RF Analog Balun TX Mode Control</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x724B6D</resetValue>
               <fields>
                  <field>
                     <name>RXTX_BAL_TX_CODE</name>
                     <description>Balun Tuning Cap Settings in Transmit Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BALUN_RX</name>
               <description>RF Analog Balun RX Mode Control</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0x49372D</resetValue>
               <fields>
                  <field>
                     <name>RXTX_BAL_RX_CODE</name>
                     <description>Balun Tuning Cap Settings in Receive Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFT_OBSV_1</name>
               <description>RF Analog DFT Observation Register 1</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DFT_FREQ_COUNTER</name>
                     <description>VCO Frequency Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_MAX_DIFF</name>
                     <description>Maximum Frequency Count Difference found by the Coarse Tune BIST</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFT_OBSV_2</name>
               <description>RF Analog DFT Observation Register 2</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>SYN_BIST_MAX_DIFF</name>
                     <description>PLL Frequency Synthesizer BIST Worst Frequency Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SYN_BIST_MAX_DIFF_CH</name>
                     <description>PLL Frequency Synthesizer BIST Worst Channel</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SYN_BIST_IGNORE_FAILS</name>
                     <description>PLL Frequency Synthesizer BIST Ignore Fails</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
